app/views/articles/show.html.erb

SELECT  "users".* FROM "users" INNER JOIN "userarticles" ON "users"."id" = "userarticles"."user_id" WHERE "userarticles"."article_id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["article_id", 4]]
---
<ul id="article-control">
    <% if @article.users.length >= 1 %>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
---
<div class="comments-area">
<h3>Comments (<%=@article.comments.size %>)</h3>