app/views/users/_form.html.erb


  <% if current_user.authorizations.pluck(:provider).include?(provider.to_s) %>
---
SELECT "authorizations"."provider" FROM "authorizations" WHERE "authorizations"."user_id" = $1  [["user_id", 1]]