app/views/pages/index.html.erb

        <p><%= @articles.order(created_at: :desc)[0].created_at.strftime("%l %M, %S") %></p>
        <a href="articles/<%= @articles.order(created_at: :desc)[0].id %>"><p class="upcoming-link">check it</p></a>
---
SELECT "articles".* FROM "articles"  ORDER BY "articles"."created_at" DESC