app/views/tags/show.html.erb

<div id= "articles-holder">
  <% @tag.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" INNER JOIN "taggings" ON "articles"."id" = "taggings"."article_id" WHERE "taggings"."tag_id" = $1  [["tag_id", 2]]