app/controllers/articles_controller.rb

    def show
        @articles = Article.all
        @comments = Comment.all
        @article = Article.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]

    def create
        @articles = Article.all
        @comments = Comment.all
        @article = Article.new(article_params)
        if @article.save
            flash.notice = "You've succesfully created the Article"
            @article.users.push(current_user)
            @article.player_names.push(current_user.email.to_s)
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "darkness"], ["body", "rises beneath the benevolent sea"], ["created_at", "2016-01-02 21:02:25.662402"], ["updated_at", "2016-01-02 21:02:25.662402"]]
INSERT INTO "userarticles" ("article_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 7], ["user_id", 1], ["created_at", "2016-01-12 21:34:17.902365"], ["updated_at", "2016-01-12 21:34:17.902365"]]

    def edit
        @articles = Article.all
        @comments = Comment.all
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]

    def update
        @articles = Article.all
        @comments = Comment.all
        @article = Article.find(params[:id])
            if (@article.users.exists?(email: current_user.email) != true) || (@article.users.length >= @article.players)
                    @article.users.push(current_user)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "articles" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "articles"."id" = $6

    def destroy
        @articles = Article.all
        @comments = Comment.all
        @article = Article.find(params[:id])
        @article.tags = []
        @article.users = []
        @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]