app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "we"], ["body", "dont lie"], ["article_id", 1], ["created_at", "2016-01-02 22:43:25.702738"], ["updated_at", "2016-01-02 22:43:25.702738"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.article_id = params[:article_id]
        @comment.save